# YOLOv8n-Lightweight 轻量化模型配置
# 使用深度可分离卷积替代标准卷积

# 模型参数
nc: 4  # 车辆类别数: car, truck, bus, motorcycle
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

# YOLOv8n backbone with Depthwise Separable Convolutions
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DSConv, [64, 3, 2]]  # 0-P1/2  深度可分离卷积
  - [-1, 1, DSConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f, [128, True]]
  - [-1, 1, DSConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f, [256, True]]
  - [-1, 1, DSConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f, [512, True]]
  - [-1, 1, DSConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)
  - [-1, 1, DSConv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)
  - [-1, 1, DSConv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)
  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
